/*

2. 프로그램의 기본구성: 주석, printf함수
3. 변수와 연산자: 연산을 위한 연산자와 값의 저장을 위한 변수, C언어의 다양한 연산자 소개, 키보드로부터의 데이터 입력과 c언어의 키워드
4. 데이터 표현방식의 이해: 컴퓨터가 데이터를 표현하는 방식, 정수와 실수의 표현방식, 비트 연산자
5. 상수와 기본 자료형: C언어가 제공하는 기본 자료형의 이해, 문자의 표현방식과 문자를 위한 자료형, 상수에 대한 이해, 자료형의 변환
6. printf 함수와 scanf 함수 정리하기: printf 함수 이야기, scanf 함수 이야기
7. 반복실행을 명령하는 반복문: while문에 의한 문장의 반복, do~while문에 의한 문장의 반복, for문에 의한 문장의 반복
8. 조건에 따른 흐름의 분기: 조건적 실행과 흐름의 분기, 반복문의 생략과 탈출: continue & break, switch문에 의한 선택적 실행과 goto문
9. C언어의 핵심!함수!: 함수를 정의하고 선언하기, 변수의 존재기간과 접근범위1: 지역변수, 변수의 존재기간과 접근범위2: 전역변수, static 변수, register 변수, 재귀함수에 대한 이해
10. 도전! 프로그래밍1

11. 1차원 배열: 배열의 이해와 배열의 선언 및 초기화 방법, 배열을 이용한 문자열 변수의 표현
12. 포인터의 이해: 포인터란 무엇인가?, 포인터와 관련 있는 연산자: & 연산자와 * 연산자
13. 포인터의 배열! 함께 이해하기: 포인터와 배열의 관계, 포인터 연산, 상수 형태의 문자열을 가리키는 포인터, 포인터 변수로 이뤄진 배열: 포인터 배열
14. 포인터와 함수에 대한 이해: 함수의 인자로 배열 전달하기, Call-by_value vs. Call-by-reference, 포인터 대상의 const 선언
15. 도전! 프로그래밍2

16. 다차원 배열: 다차원 배열의 이해와 활용, 3차원 배열
17. 포인터의 포인터: 포인터의 포인터에 대한 이해
18. 다차원 배열과 포인터의 관계: 2차원 배열이름의 포인터 형, 2차원 배열이름의 특성과 주의사항
19. 함수 포인터와 void 포인터: 함수 포인터와 void 포인터, main함수로의 인자전달
20. 도전! 프로그래밍3

*/

//이렇게 주석을 처리할 수도 있다!!