/*

2. 프로그램의 기본구성: 주석, printf함수
3. 변수와 연산자: 연산을 위한 연산자와 값의 저장을 위한 변수, C언어의 다양한 연산자 소개, 키보드로부터의 데이터 입력과 c언어의 키워드
4. 데이터 표현방식의 이해: 컴퓨터가 데이터를 표현하는 방식, 정수와 실수의 표현방식, 비트 연산자
5. 상수와 기본 자료형: C언어가 제공하는 기본 자료형의 이해, 문자의 표현방식과 문자를 위한 자료형, 상수에 대한 이해, 자료형의 변환
6. printf 함수와 scanf 함수 정리하기: printf 함수 이야기, scanf 함수 이야기
7. 반복실행을 명령하는 반복문: while문에 의한 문장의 반복, do~while문에 의한 문장의 반복, for문에 의한 문장의 반복
8. 조건에 따른 흐름의 분기: 조건적 실행과 흐름의 분기, 반복문의 생략과 탈출: continue & break, switch문에 의한 선택적 실행과 goto문
9. C언어의 핵심!함수!: 함수를 정의하고 선언하기, 변수의 존재기간과 접근범위1: 지역변수, 변수의 존재기간과 접근범위2: 전역변수, static 변수, register 변수, 재귀함수에 대한 이해
10. 도전! 프로그래밍1

*/

//이렇게 주석을 처리할 수도 있다!!